owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport.c
/****************************************************************************
 * boards/spike-prime-hub/src/stm32_legoport.c
 *
 * I/O port device-connection-manager (DCM) for SPIKE Prime Hub.
 *
 * Each of the 6 external ports (A-F) carries 5 signals (gpio1, gpio2,
 * uart_tx, uart_rx, uart_buf) used in two roles:
 *
 *   - GPIO mode (this file): the resistor-divider passive-detection scheme
 *     ported from pybricks `lib/pbio/drv/legodev/legodev_pup.c`, run from
 *     HPWORK at 2 ms cadence per yield boundary.
 *   - UART mode (Issue #43 LUMP engine): once a port is confirmed
 *     `UNKNOWN_UART (14)`, ownership is transferred to a registered
 *     handoff callback that switches the pins to UART AF.
 *
 * Detection is debounced over 20 consecutive identical scans (~400 ms
 * worst case for the longest scan path) before `confirmed_type` is updated
 * and `state_change_sem` posted to wake any pending WAIT_CONNECT /
 * WAIT_DISCONNECT ioctl.
 *
 * The DCM state machine is a faithful port of pybricks `poll_dcm()` —
 * each of the 11 `PT_YIELD(pt)` calls in pybricks corresponds to a real
 * yield boundary here, where the worker function returns and is
 * rescheduled in 2 ms.  Two `_WAIT` states (`S4_ID1_SETTLE_WAIT`,
 * `S8_PRE_FINAL_WAIT`) are no-op ticks that exist solely to honour the
 * unconditional yields at pybricks lines 199 and 278; they MUST NOT be
 * optimised away or the timing diverges from the reference.
 *
 * See `docs/{ja,en}/drivers/port-detection.md` for the full design.
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <debug.h>
#include <assert.h>

#include <nuttx/clock.h>
#include <nuttx/wqueue.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>

#include <arch/board/board_legoport.h>

#include "stm32.h"
#include "spike_prime_hub.h"

#ifdef CONFIG_LEGO_PORT

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Tick cadence — pybricks uses 2 ms between protothread yields, we mirror. */

#define LEGOPORT_TICK_MS              2

/* Debounce: 20 consecutive identical scans confirms a type change.
 * Verbatim from pybricks `AFFIRMATIVE_MATCH_COUNT`.
 */

#define LEGOPORT_AFFIRMATIVE_MATCH    20

/* UNOWNED gated re-scan: how long to idle between full scans, and how
 * many consecutive non-UNKNOWN_UART confirmations are needed to release
 * the latch.  See `DCM_LATCHED_UART_UNOWNED_IDLE` handler.
 */

#define LEGOPORT_UNOWNED_PROBE_MS     100
#define LEGOPORT_UNOWNED_DISCONNECT_K 3

/* dev_id_group classifications (pybricks `dev_id_group_t`) */

#define DEV_ID_GROUP_GND        0
#define DEV_ID_GROUP_VCC        1
#define DEV_ID_GROUP_PULL_DOWN  2
#define DEV_ID_GROUP_OPEN       3

/* Per-port GPIO pin descriptor builder for the table.  All states share
 * the same port/pin and mode flavour (no pull, push-pull); only the
 * mode/level bits differ.  Speed is 50MHz for normal pins and 2MHz for
 * the backup-domain Port D pins (PC14, PC15, PC13, PC11) per RM0430.
 *
 * GPIO_INPUT must be combined with GPIO_FLOAT (PUPDR=00) so the resistor
 * divider sees the bare pin without the internal ~40k pull biasing it.
 */

#define LP_INPUT(speed, port, pin)                                         \
  (GPIO_INPUT | GPIO_FLOAT | (speed) | (port) | (pin))

#define LP_OUT_HI(speed, port, pin)                                        \
  (GPIO_OUTPUT | GPIO_PUSHPULL | GPIO_OUTPUT_SET | (speed) | (port) | (pin))

#define LP_OUT_LO(speed, port, pin)                                        \
  (GPIO_OUTPUT | GPIO_PUSHPULL | GPIO_OUTPUT_CLEAR | (speed) | (port) | (pin))

#define LP_AF(af, speed, port, pin)                                        \
  (GPIO_ALT | GPIO_PUSHPULL | (af) | (speed) | (port) | (pin))

/* Convenience for backup-domain pins (PC13/14/15) — must use 2MHz drive. */

#define LP_INPUT_BD(port, pin)  LP_INPUT(GPIO_SPEED_2MHz, port, pin)
#define LP_OUT_HI_BD(port, pin) LP_OUT_HI(GPIO_SPEED_2MHz, port, pin)
#define LP_OUT_LO_BD(port, pin) LP_OUT_LO(GPIO_SPEED_2MHz, port, pin)

/* Standard speed pins */

#define LP_INPUT_S(port, pin)   LP_INPUT(GPIO_SPEED_50MHz, port, pin)
#define LP_OUT_HI_S(port, pin)  LP_OUT_HI(GPIO_SPEED_50MHz, port, pin)
#define LP_OUT_LO_S(port, pin)  LP_OUT_LO(GPIO_SPEED_50MHz, port, pin)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* DCM state machine — each enumerator either yields (return + reschedule)
 * or falls through (continue) to the next state.  See file-level comment
 * for the pybricks line correspondence.
 */

enum dcm_state_e
{
  /* Active scan states (pybricks `poll_dcm()`) */

  DCM_S0_INIT = 0,            /* yield: pybricks 130 */
  DCM_S1_READ_ID2_A,          /* yield: pybricks 138 */
  DCM_S2_READ_ID2_B,          /* fallthrough: branches to S2A / S8_PRE / S3 */
  DCM_S2A_TOUCH_SETTLE,       /* yield: pybricks 152 */
  DCM_S2B_TOUCH_SAMPLE,       /* fallthrough: → S8_PRE */
  DCM_S3_READ_ID1_A,          /* yield: pybricks 168 */
  DCM_S3_READ_ID1_B,          /* fallthrough: branches to S4 or S4_WAIT */
  DCM_S4_OPEN_PD,             /* yield: pybricks 187 (only on else branch) */
  DCM_S4_ID1_SETTLE_WAIT,     /* yield: pybricks 199 (UNCONDITIONAL) */
  DCM_S5_DRIVE_ID2_HI,        /* yield: pybricks 208 */
  DCM_S6_READ_ID1_C,          /* yield: pybricks 216 */
  DCM_S6_READ_ID1_D,          /* fallthrough: branches to S8_PRE / S7 */
  DCM_S7_PROBE_RX,            /* yield: pybricks 241 */
  DCM_S7_READ_RX_HI,          /* yield: pybricks 255 (only on rx==1 branch) */
  DCM_S7B_READ_RX_LO,         /* fallthrough: → S8_PRE */
  DCM_S8_PRE_FINAL_WAIT,      /* yield: pybricks 278 (UNCONDITIONAL) */
  DCM_S8_FINALIZE,            /* fallthrough: → S0 (or LATCHED_*) */

  /* Latched states (DCM paused for the port) */

  DCM_LATCHED_UART_OWNED,            /* #43 owns the pins; we do nothing */
  DCM_LATCHED_UART_UNOWNED_IDLE,     /* gated re-scan; transitions to S0 on timer */
};

struct legoport_state_s
{
  /* DCM scratch + result */

  uint8_t  state;                /* enum dcm_state_e */
  uint8_t  type_id;              /* candidate this scan */
  uint8_t  prev_type_id;         /* candidate previous scan */
  uint8_t  confirmed_type;       /* confirmed (debounced) — published value */
  uint8_t  id1_group;            /* DEV_ID_GROUP_* during scan */
  uint8_t  match_count;          /* 0..AFFIRMATIVE_MATCH */
  uint8_t  gpio_value;           /* sample scratch */
  uint8_t  prev_gpio_value;      /* sample scratch */

  /* UNOWNED re-scan state */

  uint8_t  unowned_disc_streak;  /* consecutive NONE confirmations */
  uint8_t  unowned_other_streak; /* consecutive non-UNKNOWN_UART, non-NONE */
  uint8_t  unowned_other_type;   /* type seen across the streak */
  bool     in_unowned_rescan;    /* set when entering S0 from UNOWNED idle */
  clock_t  unowned_idle_until;   /* ticks: gate expiry */

  /* Handoff registry (per-port).  Layered protections:
   *  - handoff_generation: stale-result guard
   *  - handoff_inflight + handoff_quiescent: priv lifetime guard
   *  - handoff_waiters: optimization to skip stale posts (Codex polish #3)
   */

  legoport_uart_handoff_cb_t handoff_cb;
  void                      *handoff_priv;
  uint32_t                   handoff_generation;
  uint32_t                   handoff_inflight;
  uint32_t                   handoff_waiters;
  sem_t                      handoff_quiescent;

  /* Edge notification for WAIT_CONNECT / WAIT_DISCONNECT / poll().  The
   * counter increments whenever `confirmed_type` changes; clients use the
   * delta against a snapshot to avoid missed-edge races.
   */

  uint32_t event_counter;
  sem_t    state_change_sem;

  mutex_t  lock;                 /* serializes ioctl vs HPWORK update */

  /* Flags published in `legoport_info_s::flags` */

  uint8_t  flags;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* 3x3 device-type lookup — verbatim port of `legodev_pup_type_id_lookup`
 * (pybricks legodev_pup.c:83-99).  Indexed by [id1_group][id2_group] where
 * group ∈ {GND=0, VCC=1, PULL_DOWN=2}.  ID1=OPEN is handled as the
 * UNKNOWN_UART fallback in S7_READ_RX_HI.
 */

