owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport.c
static const uint8_t g_type_lookup[3][3] =
{
  /* ID1 = GND */
  [DEV_ID_GROUP_GND] = {
    [DEV_ID_GROUP_GND]       = LEGOPORT_TYPE_LPF2_POWER,
    [DEV_ID_GROUP_VCC]       = LEGOPORT_TYPE_LPF2_TURN,
    [DEV_ID_GROUP_PULL_DOWN] = LEGOPORT_TYPE_LPF2_LIGHT2,
  },
  /* ID1 = VCC */
  [DEV_ID_GROUP_VCC] = {
    [DEV_ID_GROUP_GND]       = LEGOPORT_TYPE_LPF2_TRAIN,
    [DEV_ID_GROUP_VCC]       = LEGOPORT_TYPE_LPF2_LMOTOR,
    [DEV_ID_GROUP_PULL_DOWN] = LEGOPORT_TYPE_LPF2_LIGHT1,
  },
  /* ID1 = PULL_DOWN */
  [DEV_ID_GROUP_PULL_DOWN] = {
    [DEV_ID_GROUP_GND]       = LEGOPORT_TYPE_LPF2_MMOTOR,
    [DEV_ID_GROUP_VCC]       = LEGOPORT_TYPE_LPF2_XMOTOR,
    [DEV_ID_GROUP_PULL_DOWN] = LEGOPORT_TYPE_LPF2_LIGHT,
  },
};

/* Per-port pin table — one entry per A..F.  See
 * `docs/ja/hardware/pin-mapping.md` for the canonical mapping.
 *
 * Pin caveats encoded here:
 *   - Port D gpio1=PC15, gpio2=PC14: backup-domain I/O, GPIO_SPEED_2MHz only.
 *   - Port E gpio1=PC13:             backup-domain I/O, GPIO_SPEED_2MHz only.
 *   - Port F gpio1=PC11:             backup-domain I/O, GPIO_SPEED_2MHz only.
 *     RM0430 §6.2.4 ("PC13/PC14/PC15" wired to backup domain even with
 *     LSEON=0, but usable as GPIO when LSE is off — current path).
 *   - Port D uart_buf=PB2: also STM32 BOOT1 strap.  HW board must hold the
 *     correct level during reset; software cannot fix that.
 *   - Port A uart_buf=PA10: also STM32 OTG_FS_ID.  Defconfig sets
 *     CONFIG_OTG_ID_GPIO_DISABLE=y so NuttX upstream OTG init does not
 *     stm32_configgpio(GPIO_OTGFS_ID) and overwrite our setting.
 *
 * UART AFs (TX/RX): Port A/C/D = AF8 (UART7/UART8/UART5),
 *                   Port B/E/F = AF11 (UART4/UART10/UART9).
 * UART9 and UART10 do not currently have a NuttX serial driver — that is
 * #43's problem; #42 only stores the AF descriptors so #43 can install
 * them when it takes ownership.
 */

static const struct legoport_pin_s g_legoport_pins[BOARD_LEGOPORT_COUNT] =
{
  /* ----- Port A (UART7) ----- */
  [0] = {
    .gpio1_in     = LP_INPUT_S (GPIO_PORTD, GPIO_PIN7),    /* PD7  */
    .gpio2_in     = LP_INPUT_S (GPIO_PORTD, GPIO_PIN8),    /* PD8  */
    .gpio2_lo     = LP_OUT_LO_S(GPIO_PORTD, GPIO_PIN8),
    .gpio2_hi     = LP_OUT_HI_S(GPIO_PORTD, GPIO_PIN8),
    .uart_tx_in   = LP_INPUT_S (GPIO_PORTE, GPIO_PIN8),    /* PE8 (TX) */
    .uart_tx_hi   = LP_OUT_HI_S(GPIO_PORTE, GPIO_PIN8),
    .uart_tx_lo   = LP_OUT_LO_S(GPIO_PORTE, GPIO_PIN8),
    .uart_rx_in   = LP_INPUT_S (GPIO_PORTE, GPIO_PIN7),    /* PE7 (RX) */
    .uart_rx_lo   = LP_OUT_LO_S(GPIO_PORTE, GPIO_PIN7),
    .uart_buf_lo  = LP_OUT_LO_S(GPIO_PORTA, GPIO_PIN10),   /* PA10 */
    .uart_buf_hi  = LP_OUT_HI_S(GPIO_PORTA, GPIO_PIN10),
    .uart_tx_af   = LP_AF(GPIO_AF8, GPIO_SPEED_50MHz, GPIO_PORTE, GPIO_PIN8),
    .uart_rx_af   = LP_AF(GPIO_AF8, GPIO_SPEED_50MHz, GPIO_PORTE, GPIO_PIN7),
    .port_index   = 0,
  },
  /* ----- Port B (UART4) ----- */
  [1] = {
    .gpio1_in     = LP_INPUT_S (GPIO_PORTD, GPIO_PIN9),    /* PD9  */
    .gpio2_in     = LP_INPUT_S (GPIO_PORTD, GPIO_PIN10),   /* PD10 */
    .gpio2_lo     = LP_OUT_LO_S(GPIO_PORTD, GPIO_PIN10),
    .gpio2_hi     = LP_OUT_HI_S(GPIO_PORTD, GPIO_PIN10),
    .uart_tx_in   = LP_INPUT_S (GPIO_PORTD, GPIO_PIN1),    /* PD1 (TX) */
    .uart_tx_hi   = LP_OUT_HI_S(GPIO_PORTD, GPIO_PIN1),
    .uart_tx_lo   = LP_OUT_LO_S(GPIO_PORTD, GPIO_PIN1),
    .uart_rx_in   = LP_INPUT_S (GPIO_PORTD, GPIO_PIN0),    /* PD0 (RX) */
    .uart_rx_lo   = LP_OUT_LO_S(GPIO_PORTD, GPIO_PIN0),
    .uart_buf_lo  = LP_OUT_LO_S(GPIO_PORTA, GPIO_PIN8),    /* PA8  */
    .uart_buf_hi  = LP_OUT_HI_S(GPIO_PORTA, GPIO_PIN8),
    .uart_tx_af   = LP_AF(GPIO_AF11, GPIO_SPEED_50MHz, GPIO_PORTD, GPIO_PIN1),
    .uart_rx_af   = LP_AF(GPIO_AF11, GPIO_SPEED_50MHz, GPIO_PORTD, GPIO_PIN0),
    .port_index   = 1,
  },
  /* ----- Port C (UART8) ----- */
  [2] = {
    .gpio1_in     = LP_INPUT_S (GPIO_PORTD, GPIO_PIN11),   /* PD11 */
    .gpio2_in     = LP_INPUT_S (GPIO_PORTE, GPIO_PIN4),    /* PE4  */
    .gpio2_lo     = LP_OUT_LO_S(GPIO_PORTE, GPIO_PIN4),
    .gpio2_hi     = LP_OUT_HI_S(GPIO_PORTE, GPIO_PIN4),
    .uart_tx_in   = LP_INPUT_S (GPIO_PORTE, GPIO_PIN1),    /* PE1 (TX) */
    .uart_tx_hi   = LP_OUT_HI_S(GPIO_PORTE, GPIO_PIN1),
    .uart_tx_lo   = LP_OUT_LO_S(GPIO_PORTE, GPIO_PIN1),
    .uart_rx_in   = LP_INPUT_S (GPIO_PORTE, GPIO_PIN0),    /* PE0 (RX) */
    .uart_rx_lo   = LP_OUT_LO_S(GPIO_PORTE, GPIO_PIN0),
    .uart_buf_lo  = LP_OUT_LO_S(GPIO_PORTE, GPIO_PIN5),    /* PE5  */
    .uart_buf_hi  = LP_OUT_HI_S(GPIO_PORTE, GPIO_PIN5),
    .uart_tx_af   = LP_AF(GPIO_AF8, GPIO_SPEED_50MHz, GPIO_PORTE, GPIO_PIN1),
    .uart_rx_af   = LP_AF(GPIO_AF8, GPIO_SPEED_50MHz, GPIO_PORTE, GPIO_PIN0),
    .port_index   = 2,
  },
  /* ----- Port D (UART5) — backup-domain pins for gpio1/gpio2 ----- */
  [3] = {
    .gpio1_in     = LP_INPUT_BD(GPIO_PORTC, GPIO_PIN15),   /* PC15 (BD) */
    .gpio2_in     = LP_INPUT_BD(GPIO_PORTC, GPIO_PIN14),   /* PC14 (BD) */
    .gpio2_lo     = LP_OUT_LO_BD(GPIO_PORTC, GPIO_PIN14),
    .gpio2_hi     = LP_OUT_HI_BD(GPIO_PORTC, GPIO_PIN14),
    .uart_tx_in   = LP_INPUT_S (GPIO_PORTC, GPIO_PIN12),   /* PC12 (TX) */
    .uart_tx_hi   = LP_OUT_HI_S(GPIO_PORTC, GPIO_PIN12),
    .uart_tx_lo   = LP_OUT_LO_S(GPIO_PORTC, GPIO_PIN12),
    .uart_rx_in   = LP_INPUT_S (GPIO_PORTD, GPIO_PIN2),    /* PD2 (RX) */
    .uart_rx_lo   = LP_OUT_LO_S(GPIO_PORTD, GPIO_PIN2),
    .uart_buf_lo  = LP_OUT_LO_S(GPIO_PORTB, GPIO_PIN2),    /* PB2 (BOOT1) */
    .uart_buf_hi  = LP_OUT_HI_S(GPIO_PORTB, GPIO_PIN2),
    .uart_tx_af   = LP_AF(GPIO_AF8, GPIO_SPEED_50MHz, GPIO_PORTC, GPIO_PIN12),
    .uart_rx_af   = LP_AF(GPIO_AF8, GPIO_SPEED_50MHz, GPIO_PORTD, GPIO_PIN2),
    .port_index   = 3,
  },
  /* ----- Port E (UART10) — backup-domain pin for gpio1 ----- */
  [4] = {
    .gpio1_in     = LP_INPUT_BD(GPIO_PORTC, GPIO_PIN13),   /* PC13 (BD) */
    .gpio2_in     = LP_INPUT_S (GPIO_PORTE, GPIO_PIN12),   /* PE12 */
    .gpio2_lo     = LP_OUT_LO_S(GPIO_PORTE, GPIO_PIN12),
    .gpio2_hi     = LP_OUT_HI_S(GPIO_PORTE, GPIO_PIN12),
    .uart_tx_in   = LP_INPUT_S (GPIO_PORTE, GPIO_PIN3),    /* PE3 (TX) */
    .uart_tx_hi   = LP_OUT_HI_S(GPIO_PORTE, GPIO_PIN3),
    .uart_tx_lo   = LP_OUT_LO_S(GPIO_PORTE, GPIO_PIN3),
    .uart_rx_in   = LP_INPUT_S (GPIO_PORTE, GPIO_PIN2),    /* PE2 (RX) */
    .uart_rx_lo   = LP_OUT_LO_S(GPIO_PORTE, GPIO_PIN2),
    .uart_buf_lo  = LP_OUT_LO_S(GPIO_PORTB, GPIO_PIN5),    /* PB5  */
    .uart_buf_hi  = LP_OUT_HI_S(GPIO_PORTB, GPIO_PIN5),
    .uart_tx_af   = LP_AF(GPIO_AF11, GPIO_SPEED_50MHz, GPIO_PORTE, GPIO_PIN3),
    .uart_rx_af   = LP_AF(GPIO_AF11, GPIO_SPEED_50MHz, GPIO_PORTE, GPIO_PIN2),
    .port_index   = 4,
  },
  /* ----- Port F (UART9) — backup-domain pin for gpio1 ----- */
  [5] = {
    .gpio1_in     = LP_INPUT_BD(GPIO_PORTC, GPIO_PIN11),   /* PC11 (BD) */
    .gpio2_in     = LP_INPUT_S (GPIO_PORTE, GPIO_PIN6),    /* PE6  */
    .gpio2_lo     = LP_OUT_LO_S(GPIO_PORTE, GPIO_PIN6),
    .gpio2_hi     = LP_OUT_HI_S(GPIO_PORTE, GPIO_PIN6),
    .uart_tx_in   = LP_INPUT_S (GPIO_PORTD, GPIO_PIN15),   /* PD15 (TX) */
    .uart_tx_hi   = LP_OUT_HI_S(GPIO_PORTD, GPIO_PIN15),
    .uart_tx_lo   = LP_OUT_LO_S(GPIO_PORTD, GPIO_PIN15),
    .uart_rx_in   = LP_INPUT_S (GPIO_PORTD, GPIO_PIN14),   /* PD14 (RX) */
    .uart_rx_lo   = LP_OUT_LO_S(GPIO_PORTD, GPIO_PIN14),
    .uart_buf_lo  = LP_OUT_LO_S(GPIO_PORTC, GPIO_PIN5),    /* PC5  */
    .uart_buf_hi  = LP_OUT_HI_S(GPIO_PORTC, GPIO_PIN5),
    .uart_tx_af   = LP_AF(GPIO_AF11, GPIO_SPEED_50MHz, GPIO_PORTD, GPIO_PIN15),
    .uart_rx_af   = LP_AF(GPIO_AF11, GPIO_SPEED_50MHz, GPIO_PORTD, GPIO_PIN14),
    .port_index   = 5,
  },
};

