owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport.c
static struct legoport_state_s g_legoport_state[BOARD_LEGOPORT_COUNT];
static struct work_s            g_legoport_work;
static bool                     g_legoport_initialized;

/* HPWORK cadence monitoring — see `LEGOPORT_GET_STATS` ioctl. */

static volatile uint32_t g_max_step_us;
static volatile uint32_t g_max_interval_us;
static clock_t           g_last_invoke_ticks;

/****************************************************************************
 * Forward Declarations
 ****************************************************************************/

static void legoport_dcm_step(int port);
static void legoport_dcm_worker(FAR void *arg);
static void legoport_post_change(struct legoport_state_s *s, uint8_t new_type);
static void legoport_invoke_handoff(int port);

/****************************************************************************
 * Helpers
 ****************************************************************************/

/* Microsecond timestamp helper.  USEC_PER_TICK is 10 in this build, so
 * the worst rounding is ±10 µs which is fine for the cadence stats.
 */

static inline uint32_t legoport_now_us(void)
{
  return (uint32_t)TICK2USEC(clock_systime_ticks());
}

/* Wrapper so debug printfs from the worker have a port label. */

#define LEGOPORT_PORT_CHAR(port)  ((char)('A' + (port)))

/* Update the published flags field after `confirmed_type` changes.  Caller
 * must hold `s->lock`.
 */

static void legoport_update_flags(struct legoport_state_s *s)
{
  uint8_t f = 0;

  if (s->confirmed_type != LEGOPORT_TYPE_NONE)
    {
      f |= LEGOPORT_FLAG_CONNECTED;
    }

  if (s->confirmed_type == LEGOPORT_TYPE_LPF2_UNKNOWN_UART)
    {
      f |= LEGOPORT_FLAG_IS_UART;
    }
  else if (s->confirmed_type != LEGOPORT_TYPE_NONE)
    {
      f |= LEGOPORT_FLAG_IS_PASSIVE;
    }

  if (s->state == DCM_LATCHED_UART_OWNED)
    {
      f |= LEGOPORT_FLAG_HANDOFF_OK;
    }

  s->flags = f;
}

/* Post a state-change edge: bump counter, post sem (only if waiters), and
 * publish flags.  Caller must hold `s->lock`.
 */

static void legoport_post_change(struct legoport_state_s *s, uint8_t new_type)
{
  if (s->confirmed_type == new_type)
    {
      return;
    }

  s->confirmed_type = new_type;
  s->event_counter++;
  legoport_update_flags(s);

  /* Wake every waiter without spamming posts beyond what's needed.  This
   * is the dual of the "rxsem" pattern in stm32_btuart_chardev.c.
   */

  int sval;
  if (nxsem_get_value(&s->state_change_sem, &sval) == 0 && sval <= 0)
    {
      nxsem_post(&s->state_change_sem);
    }
}

/****************************************************************************
 * Handoff invocation (lock-protected, with inflight + generation guards)
 ****************************************************************************/

static void legoport_invoke_handoff(int port)
{
  struct legoport_state_s *s = &g_legoport_state[port];
  legoport_uart_handoff_cb_t cb_local;
  void                     *priv_local;
  uint32_t                  gen_local;
  int                       ret = -ENOSYS;

  nxmutex_lock(&s->lock);
  cb_local   = s->handoff_cb;
  priv_local = s->handoff_priv;
  gen_local  = s->handoff_generation;
  if (cb_local != NULL)
    {
      s->handoff_inflight++;
    }

  nxmutex_unlock(&s->lock);

  if (cb_local != NULL)
    {
      ret = cb_local(port, &g_legoport_pins[port], priv_local);
    }

  nxmutex_lock(&s->lock);

  /* Only apply the result if no concurrent unregister happened. */

  if (cb_local != NULL && gen_local == s->handoff_generation)
    {
      if (ret == OK)
        {
          s->state  = DCM_LATCHED_UART_OWNED;
          s->flags |= LEGOPORT_FLAG_HANDOFF_OK;
        }
      else
        {
          /* Fall back to UNOWNED gated re-scan. */
          s->state                = DCM_LATCHED_UART_UNOWNED_IDLE;
          s->in_unowned_rescan    = false;
          s->unowned_disc_streak  = 0;
          s->unowned_other_streak = 0;
          s->unowned_other_type   = LEGOPORT_TYPE_NONE;
          s->unowned_idle_until   = clock_systime_ticks() +
                                    MSEC2TICK(LEGOPORT_UNOWNED_PROBE_MS);
        }
    }
  else if (cb_local == NULL)
    {
      /* No CB registered at the time of confirmation — go straight to
       * UNOWNED gated re-scan.
       */
      s->state                = DCM_LATCHED_UART_UNOWNED_IDLE;
      s->in_unowned_rescan    = false;
      s->unowned_disc_streak  = 0;
      s->unowned_other_streak = 0;
      s->unowned_other_type   = LEGOPORT_TYPE_NONE;
      s->unowned_idle_until   = clock_systime_ticks() +
                                MSEC2TICK(LEGOPORT_UNOWNED_PROBE_MS);
    }

  /* Always drop the inflight refcount and wake any drainers. */

  if (cb_local != NULL)
    {
      s->handoff_inflight--;
      if (s->handoff_inflight == 0 && s->handoff_waiters > 0)
        {
          nxsem_post(&s->handoff_quiescent);
        }
    }

  nxmutex_unlock(&s->lock);
}

/****************************************************************************
 * DCM step — one HPWORK invocation per port, fall through non-yield states
 ****************************************************************************/

static void legoport_dcm_step(int port)
{
  struct legoport_state_s   *s = &g_legoport_state[port];
  const struct legoport_pin_s *p = &g_legoport_pins[port];

  for (; ; )
    {
      switch (s->state)
        {
          /* --- Latched: paused, no work --- */
          case DCM_LATCHED_UART_OWNED:
            return;

          case DCM_LATCHED_UART_UNOWNED_IDLE:
            if ((sclock_t)(clock_systime_ticks() - s->unowned_idle_until) < 0)
              {
                /* Gate not yet expired — return without consuming a tick
                 * for the state machine.
                 */
                return;
              }

            /* Re-arm scan.  Reset debounce so the rescan starts fresh. */

            s->state             = DCM_S0_INIT;
            s->in_unowned_rescan = true;
            s->match_count       = 0;
            s->prev_type_id      = LEGOPORT_TYPE_NONE;
            continue;  /* fall through into S0 */

          /* --- Active scan --- */

          case DCM_S0_INIT:
            /* pybricks 121-130: drive ID1 high (uart_tx high, uart_buf low),
             * ID2 input.  Then yield.
             */
            stm32_configgpio(p->uart_tx_hi);
            stm32_configgpio(p->uart_buf_lo);
            stm32_configgpio(p->gpio2_in);
            s->type_id      = LEGOPORT_TYPE_NONE;
            s->id1_group    = DEV_ID_GROUP_OPEN;
            s->state        = DCM_S1_READ_ID2_A;
            return;

          case DCM_S1_READ_ID2_A:
            /* pybricks 133-138: sample ID2 → prev, drive ID1 low, yield. */
            s->prev_gpio_value = stm32_gpioread(p->gpio2_in) ? 1 : 0;
            stm32_configgpio(p->uart_tx_lo);
            s->state        = DCM_S2_READ_ID2_B;
            return;

          case DCM_S2_READ_ID2_B:
            /* pybricks 140-167: sample ID2 → cur, branch on transition. */
            s->gpio_value = stm32_gpioread(p->gpio2_in) ? 1 : 0;

            if (s->prev_gpio_value == 1 && s->gpio_value == 0)
              {
                /* TOUCH (5) — pybricks 148-160. */
                s->type_id = LEGOPORT_TYPE_LPF2_TOUCH;
                stm32_configgpio(p->uart_buf_hi);
                stm32_configgpio(p->uart_tx_in);
                s->state   = DCM_S2A_TOUCH_SETTLE;
                return;  /* yield: pybricks 152 */
              }

