owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport.c
            if (s->prev_gpio_value == 0 && s->gpio_value == 1)
              {
                /* TPOINT (11) — pybricks 162-163. */
                s->type_id = LEGOPORT_TYPE_LPF2_TPOINT;
                s->state   = DCM_S8_PRE_FINAL_WAIT;
                continue;  /* fallthrough into the unconditional final yield */
              }

            /* Else: continue with ID1 group probe. */

            s->state = DCM_S3_READ_ID1_A;
            continue;

          case DCM_S2A_TOUCH_SETTLE:
            /* No-op tick: pybricks 152 yield was here.  Fall through to
             * sample (which intentionally discards the analog value).
             */
            s->state = DCM_S2B_TOUCH_SAMPLE;
            continue;

          case DCM_S2B_TOUCH_SAMPLE:
            /* pybricks 158-160: read gpio1 to update analog touch value.
             * #42 does NOT expose this analog reading — type=TOUCH is
             * already latched.  Reading the pin and discarding the value
             * keeps the GPIO sequence identical to pybricks for any
             * cap-debounce behaviour the LEGO hardware relies on.
             */
            (void)stm32_gpioread(p->gpio1_in);
            s->state = DCM_S8_PRE_FINAL_WAIT;
            continue;

          case DCM_S3_READ_ID1_A:
            /* pybricks 164-168: sample gpio1 → prev, drive ID1 high, yield. */
            s->prev_gpio_value = stm32_gpioread(p->gpio1_in) ? 1 : 0;
            stm32_configgpio(p->uart_tx_hi);
            s->state           = DCM_S3_READ_ID1_B;
            return;

          case DCM_S3_READ_ID1_B:
            /* pybricks 170-197: sample gpio1 → cur, classify ID1 group. */
            s->gpio_value = stm32_gpioread(p->gpio1_in) ? 1 : 0;

            if (s->prev_gpio_value == 1 && s->gpio_value == 1)
              {
                s->id1_group = DEV_ID_GROUP_VCC;
                s->state     = DCM_S4_ID1_SETTLE_WAIT;
                continue;  /* fall through to the unconditional yield */
              }

            if (s->prev_gpio_value == 0 && s->gpio_value == 0)
              {
                s->id1_group = DEV_ID_GROUP_GND;
                s->state     = DCM_S4_ID1_SETTLE_WAIT;
                continue;
              }

            /* OPEN / PULL_DOWN slow path: switch ID1 to input + buf high,
             * yield, then sample again.
             */
            stm32_configgpio(p->uart_buf_hi);
            stm32_configgpio(p->uart_tx_in);
            s->state = DCM_S4_OPEN_PD;
            return;  /* yield: pybricks 187 */

          case DCM_S4_OPEN_PD:
            /* pybricks 189-196: gpio1==1 → OPEN, ==0 → PULL_DOWN. */
            s->id1_group = (stm32_gpioread(p->gpio1_in)
                            ? DEV_ID_GROUP_OPEN : DEV_ID_GROUP_PULL_DOWN);
            s->state     = DCM_S4_ID1_SETTLE_WAIT;
            continue;  /* fall through to unconditional yield */

          case DCM_S4_ID1_SETTLE_WAIT:
            /* pybricks 199 UNCONDITIONAL yield — settle before driving
             * ID2 high.  Real yield boundary: do not skip.
             */
            s->state = DCM_S5_DRIVE_ID2_HI;
            return;

          case DCM_S5_DRIVE_ID2_HI:
            /* pybricks 201-208: ID1 input + buf high, gpio2 high, yield. */
            stm32_configgpio(p->uart_buf_hi);
            stm32_configgpio(p->uart_tx_in);
            stm32_configgpio(p->gpio2_hi);
            s->state = DCM_S6_READ_ID1_C;
            return;

          case DCM_S6_READ_ID1_C:
            /* pybricks 210-216: sample gpio1 → prev, gpio2 low, yield. */
            s->prev_gpio_value = stm32_gpioread(p->gpio1_in) ? 1 : 0;
            stm32_configgpio(p->gpio2_lo);
            s->state           = DCM_S6_READ_ID1_D;
            return;

          case DCM_S6_READ_ID1_D:
            /* pybricks 218-275: sample gpio1 → cur, branch. */
            s->gpio_value = stm32_gpioread(p->gpio1_in) ? 1 : 0;

            if (s->prev_gpio_value == 1 && s->gpio_value == 0)
              {
                if (s->id1_group == DEV_ID_GROUP_OPEN)
                  {
                    s->type_id = LEGOPORT_TYPE_LPF2_3_PART;
                  }
                /* else: type_id stays NONE for this scan */
                s->state = DCM_S8_PRE_FINAL_WAIT;
                continue;
              }

            if (s->prev_gpio_value == 0 && s->gpio_value == 1)
              {
                s->type_id = LEGOPORT_TYPE_LPF2_EXPLOD;
                s->state   = DCM_S8_PRE_FINAL_WAIT;
                continue;
              }

            /* Else: probe uart_rx for ID2 group. */

            stm32_configgpio(p->uart_tx_hi);
            stm32_configgpio(p->uart_buf_lo);
            stm32_configgpio(p->gpio2_hi);
            s->state = DCM_S7_PROBE_RX;
            return;  /* yield: pybricks 241 */

          case DCM_S7_PROBE_RX:
            /* pybricks 243-274: sample uart_rx, branch. */
            if (stm32_gpioread(p->uart_rx_in))
              {
                /* uart_rx high — drive gpio2 low + uart_rx output low
                 * (cap-debounce trick from pybricks 246-253).
                 */
                stm32_configgpio(p->gpio2_lo);
                stm32_configgpio(p->uart_rx_lo);
                s->state = DCM_S7_READ_RX_HI;
                return;  /* yield: pybricks 255 */
              }
            else
              {
                /* uart_rx low — id2 == GND.  Lookup or UNKNOWN_UART. */
                if (s->id1_group < 3)
                  {
                    s->type_id =
                        g_type_lookup[s->id1_group][DEV_ID_GROUP_GND];
                  }
                else
                  {
                    s->type_id = LEGOPORT_TYPE_LPF2_UNKNOWN_UART;
                  }
                s->state = DCM_S8_PRE_FINAL_WAIT;
                continue;
              }

          case DCM_S7_READ_RX_HI:
            /* pybricks 257-265: sample uart_rx after cap-debounce. */
            if (!stm32_gpioread(p->uart_rx_in))
              {
                /* Stayed low → ID2 group = PULL_DOWN. */
                if (s->id1_group < 3)
                  {
                    s->type_id =
                        g_type_lookup[s->id1_group][DEV_ID_GROUP_PULL_DOWN];
                  }
              }
            else
              {
                /* Bounced back high → ID2 group = VCC. */
                if (s->id1_group < 3)
                  {
                    s->type_id =
                        g_type_lookup[s->id1_group][DEV_ID_GROUP_VCC];
                  }
              }
            s->state = DCM_S7B_READ_RX_LO;
            continue;

          case DCM_S7B_READ_RX_LO:
            /* Placeholder fallthrough after S7_READ_RX_HI processing. */
            s->state = DCM_S8_PRE_FINAL_WAIT;
            continue;

