owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport.c
          case DCM_S8_PRE_FINAL_WAIT:
            /* pybricks 278 UNCONDITIONAL yield — every classification path
             * funnels through this wait before the finalize block.
             */
            s->state = DCM_S8_FINALIZE;
            return;

          case DCM_S8_FINALIZE:
            {
              /* pybricks 280-298: reset pins to safe state, debounce. */
              stm32_configgpio(p->gpio2_in);
              stm32_configgpio(p->uart_tx_hi);
              stm32_configgpio(p->uart_buf_lo);

              if (s->type_id == s->prev_type_id)
                {
                  if (s->match_count < UINT8_MAX)
                    {
                      s->match_count++;
                    }

                  if (s->match_count >= LEGOPORT_AFFIRMATIVE_MATCH)
                    {
                      uint8_t new_confirmed = s->type_id;

                      /* Lock for confirmed_type / event_counter / flags. */

                      nxmutex_lock(&s->lock);
                      legoport_post_change(s, new_confirmed);
                      nxmutex_unlock(&s->lock);

                      if (s->in_unowned_rescan)
                        {
                          /* UNOWNED rescan: streak logic for disconnect /
                           * type-change.
                           */
                          if (new_confirmed == LEGOPORT_TYPE_LPF2_UNKNOWN_UART)
                            {
                              /* Same UART device still there; re-arm gate. */
                              s->unowned_disc_streak  = 0;
                              s->unowned_other_streak = 0;
                              s->in_unowned_rescan    = false;
                              s->state                = DCM_LATCHED_UART_UNOWNED_IDLE;
                              s->unowned_idle_until   = clock_systime_ticks()
                                  + MSEC2TICK(LEGOPORT_UNOWNED_PROBE_MS);
                              return;
                            }
                          else if (new_confirmed == LEGOPORT_TYPE_NONE)
                            {
                              s->unowned_disc_streak++;
                              if (s->unowned_disc_streak
                                  >= LEGOPORT_UNOWNED_DISCONNECT_K)
                                {
                                  s->in_unowned_rescan = false;
                                  s->state             = DCM_S0_INIT;
                                  s->match_count       = 0;
                                  s->prev_type_id      = LEGOPORT_TYPE_NONE;
                                  return;
                                }
                              s->in_unowned_rescan  = false;
                              s->state              = DCM_LATCHED_UART_UNOWNED_IDLE;
                              s->unowned_idle_until = clock_systime_ticks()
                                  + MSEC2TICK(LEGOPORT_UNOWNED_PROBE_MS);
                              return;
                            }
                          else
                            {
                              /* New non-UART, non-NONE type — track it. */
                              if (s->unowned_other_type == new_confirmed)
                                {
                                  s->unowned_other_streak++;
                                }
                              else
                                {
                                  s->unowned_other_streak = 1;
                                  s->unowned_other_type   = new_confirmed;
                                }

                              if (s->unowned_other_streak
                                  >= LEGOPORT_UNOWNED_DISCONNECT_K)
                                {
                                  s->in_unowned_rescan = false;
                                  s->state             = DCM_S0_INIT;
                                  s->match_count       = 0;
                                  s->prev_type_id      = LEGOPORT_TYPE_NONE;
                                  return;
                                }
                              s->in_unowned_rescan  = false;
                              s->state              = DCM_LATCHED_UART_UNOWNED_IDLE;
                              s->unowned_idle_until = clock_systime_ticks()
                                  + MSEC2TICK(LEGOPORT_UNOWNED_PROBE_MS);
                              return;
                            }
                        }

                      /* Normal scan path: if we just confirmed UNKNOWN_UART
                       * for the first time, attempt handoff.
                       */
                      if (new_confirmed == LEGOPORT_TYPE_LPF2_UNKNOWN_UART)
                        {
                          /* legoport_invoke_handoff() drops + reacquires
                           * the lock and sets the final state (OWNED or
                           * UNOWNED_IDLE) under the lock based on the CB
                           * result, so we can return immediately.
                           */
                          legoport_invoke_handoff(port);
                          return;
                        }
                    }
                }
              else
                {
                  s->match_count = 0;
                }

              s->prev_type_id = s->type_id;

              /* Restart the scan. */

              s->state = DCM_S0_INIT;
              return;
            }

          default:
            /* Defensive: shouldn't happen.  Reset to S0. */
            s->state = DCM_S0_INIT;
            return;
        }
    }
}

/****************************************************************************
 * HPWORK worker
 ****************************************************************************/

static void legoport_dcm_worker(FAR void *arg)
{
  UNUSED(arg);

  clock_t  now_ticks = clock_systime_ticks();
  uint32_t t0_us     = (uint32_t)TICK2USEC(now_ticks);

  if (g_last_invoke_ticks != 0)
    {
      uint32_t interval =
          (uint32_t)TICK2USEC((sclock_t)(now_ticks - g_last_invoke_ticks));
      if (interval > g_max_interval_us)
        {
          g_max_interval_us = interval;
        }
    }

  g_last_invoke_ticks = now_ticks;

  for (int p = 0; p < BOARD_LEGOPORT_COUNT; p++)
    {
      legoport_dcm_step(p);
    }

  uint32_t dt = legoport_now_us() - t0_us;
  if (dt > g_max_step_us)
    {
      g_max_step_us = dt;
    }

  work_queue(HPWORK, &g_legoport_work, legoport_dcm_worker, NULL,
             MSEC2TICK(LEGOPORT_TICK_MS));
}

/****************************************************************************
 * Public API
 ****************************************************************************/

int stm32_legoport_initialize(void)
{
  if (g_legoport_initialized)
    {
      return OK;
    }

