owhinata/spike-nx/boards/spike-prime-hub/src/stm32_legoport.c
  /* Configure all pins to a safe DCM-start state and init per-port state. */

  for (int p = 0; p < BOARD_LEGOPORT_COUNT; p++)
    {
      const struct legoport_pin_s *pin = &g_legoport_pins[p];
      struct legoport_state_s     *s   = &g_legoport_state[p];

      memset(s, 0, sizeof(*s));
      s->state          = DCM_S0_INIT;
      s->confirmed_type = LEGOPORT_TYPE_NONE;
      s->prev_type_id   = LEGOPORT_TYPE_NONE;
      nxmutex_init(&s->lock);
      nxsem_init(&s->state_change_sem, 0, 0);
      nxsem_init(&s->handoff_quiescent, 0, 0);

      /* Power-on default: ID1 high, buf low (= buffer enabled), ID2 input.
       * Same as DCM_S0_INIT entry conditions.
       */
      stm32_configgpio(pin->uart_tx_hi);
      stm32_configgpio(pin->uart_buf_lo);
      stm32_configgpio(pin->gpio2_in);
      stm32_configgpio(pin->gpio1_in);
      stm32_configgpio(pin->uart_rx_in);
    }

  g_max_step_us       = 0;
  g_max_interval_us   = 0;
  g_last_invoke_ticks = 0;
  g_legoport_initialized = true;

  /* Kick the HPWORK loop. */

  return work_queue(HPWORK, &g_legoport_work, legoport_dcm_worker, NULL,
                    MSEC2TICK(LEGOPORT_TICK_MS));
}

int stm32_legoport_register_uart_handoff(int port,
                                         legoport_uart_handoff_cb_t cb,
                                         void *priv)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT)
    {
      return -EINVAL;
    }

  struct legoport_state_s *s = &g_legoport_state[port];

  nxmutex_lock(&s->lock);

  s->handoff_cb   = cb;
  s->handoff_priv = priv;
  s->handoff_generation++;

  /* Drain any in-flight CB so the caller can free `priv` after we
   * return.  Use the uninterruptible variant to keep the lifetime
   * guarantee intact across signals.
   */

  while (s->handoff_inflight != 0)
    {
      s->handoff_waiters++;
      nxmutex_unlock(&s->lock);
      nxsem_wait_uninterruptible(&s->handoff_quiescent);
      nxmutex_lock(&s->lock);
      s->handoff_waiters--;
    }

  nxmutex_unlock(&s->lock);
  return OK;
}

int stm32_legoport_release_uart(int port)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT)
    {
      return -EINVAL;
    }

  struct legoport_state_s     *s = &g_legoport_state[port];
  const struct legoport_pin_s *p = &g_legoport_pins[port];

  nxmutex_lock(&s->lock);

  /* Bump generation and clear the CB so any concurrent invoke aborts. */

  s->handoff_cb = NULL;
  s->handoff_priv = NULL;
  s->handoff_generation++;

  while (s->handoff_inflight != 0)
    {
      s->handoff_waiters++;
      nxmutex_unlock(&s->lock);
      nxsem_wait_uninterruptible(&s->handoff_quiescent);
      nxmutex_lock(&s->lock);
      s->handoff_waiters--;
    }

  /* Reset pins back to DCM-start state regardless of which latched state
   * we were in.  This is the GPIO equivalent of "go to S0_INIT".
   */

  stm32_configgpio(p->uart_tx_hi);
  stm32_configgpio(p->uart_buf_lo);
  stm32_configgpio(p->gpio2_in);
  stm32_configgpio(p->gpio1_in);
  stm32_configgpio(p->uart_rx_in);

  s->state                = DCM_S0_INIT;
  s->match_count          = 0;
  s->prev_type_id         = LEGOPORT_TYPE_NONE;
  s->in_unowned_rescan    = false;
  s->unowned_disc_streak  = 0;
  s->unowned_other_streak = 0;
  s->unowned_other_type   = LEGOPORT_TYPE_NONE;
  s->flags               &= ~LEGOPORT_FLAG_HANDOFF_OK;

  /* Clearing confirmed_type also raises a state-change edge so any
   * waiter for "disconnect" wakes up.
   */
  legoport_post_change(s, LEGOPORT_TYPE_NONE);

  nxmutex_unlock(&s->lock);
  return OK;
}

uint32_t stm32_legoport_get_max_step_us(void)
{
  return g_max_step_us;
}

uint32_t stm32_legoport_get_max_interval_us(void)
{
  return g_max_interval_us;
}

/* Accessors used by the chardev shim — exposed via spike_prime_hub.h. */

int stm32_legoport_get_info(int port, FAR struct legoport_info_s *out)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT || out == NULL)
    {
      return -EINVAL;
    }

  struct legoport_state_s *s = &g_legoport_state[port];

  nxmutex_lock(&s->lock);
  out->device_type   = s->confirmed_type;
  out->flags         = s->flags;
  out->reserved[0]   = 0;
  out->reserved[1]   = 0;
  out->event_counter = s->event_counter;
  nxmutex_unlock(&s->lock);

  return OK;
}

int stm32_legoport_wait_change(int port, uint32_t snapshot,
                               uint32_t timeout_ms,
                               FAR uint32_t *new_counter_out)
{
  if (port < 0 || port >= BOARD_LEGOPORT_COUNT)
    {
      return -EINVAL;
    }

  struct legoport_state_s *s = &g_legoport_state[port];

  for (; ; )
    {
      nxmutex_lock(&s->lock);
      if (s->event_counter != snapshot)
        {
          uint32_t cur = s->event_counter;
          nxmutex_unlock(&s->lock);
          if (new_counter_out != NULL)
            {
              *new_counter_out = cur;
            }
          return OK;
        }

      nxmutex_unlock(&s->lock);

      int ret;
      if (timeout_ms == 0)
        {
          ret = nxsem_wait(&s->state_change_sem);
        }
      else
        {
          ret = nxsem_tickwait(&s->state_change_sem, MSEC2TICK(timeout_ms));
        }

      if (ret == -ETIMEDOUT)
        {
          return -ETIMEDOUT;
        }

      if (ret == -EINTR)
        {
          /* WAIT ioctls are user-callable so respect EINTR. */
          return -EINTR;
        }
    }
}

#endif /* CONFIG_LEGO_PORT */
